app/controllers/items_controller.rb

  def create
    @list = List.find(params[:list_id])
    @item = @list.items.create(params[:item])
---
SELECT * FROM `lists` WHERE (`lists`.`id` = 1)
INSERT INTO `items` (`updated_at`, `title`, `description`, `value`, `list_id`, `user_id`, `created_at`) VALUES('2009-05-25 02:23:53', 'Prayer Tool', 'A Prayer tool for students to use.', 5, 1, NULL, '2009-05-25 02:23:53')